Repository: MenwaLab/MosaicDroid
Catalog: MosaicDroid.Core/Resources/Strings.*.resx
Languages: es

# Btn_Load
source: Load
es: Cargar

# Btn_Resize
source: Resize
es: Redimensionar

# Btn_Run
source: Run
es: Ejecutar

# Btn_Save
source: Save
es: Guardar

# Docs_NotFound
source: Help file not found.
es: Archivo no encontrado

# Err_InvalidValue
source: Sorry, invalid value: {0}
es: Disculpe, valor inválido: {0}

# Lbl_Language
source: Language
es: Idioma

# Lbl_Size
source: Size
es: Tamaño

# Err_MissingNewLine
source: Missing newline after
es: Salto de línea faltante después de {0}

# Err_Runtime
source: Runtime error: {0}
es: Error en tiempo de ejecución: {0}

# Lex_Err
source: Lexer Error
es: Error Léxico

source: Parser Error
es: Error al Parsear

# Sem_Err
source: Semantic Error
es: Error semántico

# Inv_DrwLine
source: Invalid arguments to DrawLine at
es: Argumento inválido en DrawLine

# Err_LabelUndefined
source: Label {0} not declared
es: Error en tiempo de ejecución: etiqueta '{0}' no declarada

# Btn_Unmute
source: Unmute
es: Reproducir

# Btn_Mute
source: Mute
es: Silenciar

# Inv_DrwCircle
source: Invalid arguments to DrawCircle at
es: Argumentos inválidos para DrawCircle en

# Inv_DrwRectangle
source: Invalid arguments to DrawLine at
es: Argumentos inválidos para DrawLine en

# PotentialInfiniteLoop
source: Potential infinite loop at
es: Posible bucle infinito en {0}:{1}

# MovedOutsideCanvas
source: Moved outside canvas at
es: Movido fuera del lienzo en {0},{1}

# DivByZero
source: Division by zero at
es: División por cero en {0}:{1}

# ModulusByZero
source: Modulus by zero at
es: Módulo por cero en {0}:{1}

source: Undefined variable
es: Variable indefinida {0}

# ZeroToZeroPower
source: Zero to zero power (0^0) at
es: Cero elevado a la potencia de cero (0^0) en {0}:{1}

# ExpectedSpawn
source: Please make sure your code starts with a Spawn(x,y)
es: Asegúrate de que tu código comience con un Spawn(x,y)

# MissingNewLine
source: Missing newline after
es: Falta nueva línea {0}

# MissingParenthesis
source: Expected
es: Se esperaba {0}

# MissingOpenParen
source: Sorry, there's a missing open parenthesis
es: Lo siento, falta un paréntesis de apertura {0}

# InvalidVariableName
source: Sorry, please make sure the variable name {0} is valid according to the grammar rules
es: Lo siento, asegúrate de que el nombre de la variable {0} sea válido según las reglas gramaticales

# InvalidLabelName
source: Sorry, please make sure the label name {0} is valid according to the grammar rules
es: Lo siento, asegúrate de que el nombre de la etiqueta {0} sea válido según las reglas gramaticales

source: Unexpected token
es: Token inesperado

# MissingQuotation
source: Please make sure your color is inside quotations
es: Asegúrate de que tu color esté entre comillas

# UnknownInstrFunc
source: Unknown Instruction or Function
es: Instrucción o Función desconocida {0}

# DuplicateSpawn
source: Only one Spawn(x,y) allowed
es: Solo se permite un Spawn(x,y)

# DuplicateLabel
source: Sorry the label {0} can only be declared once
es: Lo siento, la etiqueta {0} solo se puede declarar una vez.

# UndefinedVariableSemantic
source: Variable {0} is not declared
es: La variable '{0}' no está declarada

# InvalidColor
source: Sorry, unknown color detected:
es: Lo siento, color desconocido detectado: '{0}'

# InvalidGoTo
source: Sorry, please make sure the condition for the GoTo is boolean
es: Lo siento, asegúrate de que la condición para GoTo sea booleana

# InvalidOperands
source: Sorry, both operands for the operation {0} need to be both integers or both be text (for boolean operations)
es: Lo siento, ambos operandos para la operación {0} deben ser enteros o ambos deben ser texto (para operaciones booleanas)

# ArgMismatch
source: Sorry, for {0} we expect argument {1} to be of type {2} but got {3}
es: Lo siento, para {0} esperamos que el argumento {1} sea del tipo {2} pero se obtuvo {3}

# WrongArity
source: Sorry, for {0} we expect {1} arguments but got {2}
es: Lo siento, para {0} esperamos {1} argumentos pero se obtuvieron {2}

# UndefinedLabel
source: Sorry, label {0} not declared
es: Lo siento, la etiqueta '{0}' no está declarada

# InvalidAssign
source: Cannot assign invalid expression to:
es: No se puede asignar una expresión inválida a:

# InvalidFunctionCall
source: Function calls cannot be nested as arguments
es: Las llamadas a funciones no pueden anidarse como argumentos

# UnrecognizedChar
source: Unrecognized Character
es: Carácter no reconocido

# UnterminatedString
source: Sorry, unterminated string literal
es: Lo siento, literal de cadena sin terminar

# UnterminatedText
source: Sorry, unterminated text literal; expected closing
es: Lo siento, literal de texto sin terminar; se esperaba cierre

# InvalidId
source: Sorry, please fix the invalid identifier
es: Lo siento, por favor corrige el identificador inválido

# InvalidInt
source: Sorry, please fix the invalid integer
es: Lo siento, por favor corrige el entero inválido
